In [1]:
import pandas as ka

print(ka.__version__)

1.1.3

In [2]:
data = {'nama':['Bryan Domani', 'Jerome Polin', 'Jessica Jane'],
       'tempat_kelahiran':['Muchen, Jerman', 'Jakarta, DKI Jakarta', 'Jakarta, DKI Jakarta']}
df = ka.DataFrame(data)
df

           nama      tempat_kelahiran
0  Bryan Domani        Muchen, Jerman
1  Jerome Polin  Jakarta, DKI Jakarta
2  Jessica Jane  Jakarta, DKI Jakarta

In [3]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama      tempat_kelahiran nama_depan nama_belakang
0  Bryan Domani        Muchen, Jerman      Bryan        Domani
1  Jerome Polin  Jakarta, DKI Jakarta     Jerome         Polin
2  Jessica Jane  Jakarta, DKI Jakarta    Jessica          Jane

In [4]:
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Bryan Domani,"Muchen, Jerman",Bryan,Domani,Muchen,Jerman
1,Jerome Polin,"Jakarta, DKI Jakarta",Jerome,Polin,Jakarta,DKI Jakarta
2,Jessica Jane,"Jakarta, DKI Jakarta",Jessica,Jane,Jakarta,DKI Jakarta